https://medium.com/dunder-data/selecting-subsets-of-data-in-pandas-6fcd0170be9c

In [38]:
import pandas as pd
import numpy as np
df = pd.DataFrame({"state":["NY","TX","FL","AL","AK","TX","TX"],
                  "color":["blue","green","red","white","gray","black","red"],
                  "food": ["Steak","Lamb","Mango","Apple","Cheese","Melon","Beans"],
                  "age":  [30,2,12,4,32,33,69],
                  "height":[165,70,120,80,180,172,150],
                  "score": [4.6,8.3,9.0,3.3,1.8,9.5,2.2]
                 },
                  index =["Jane","Niko","Aaron","Penelope","Dean","Christina","Cornelia"]
                )
df

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

In [9]:
 index = df.index
 index
 columns = df.columns
 columns
 values = df.values
 values

array([['NY', 'blue', 'Steak', 30, 165, 4.6],
       ['TX', 'green', 'Lamb', 2, 70, 8.3],
       ['FL', 'red', 'Mango', 12, 120, 9.0],
       ['AL', 'white', 'Apple', 4, 80, 3.3],
       ['AK', 'gray', 'Cheese', 32, 180, 1.8],
       ['TX', 'black', 'Melon', 33, 172, 9.5],
       ['TX', 'red', 'Beans', 69, 150, 2.2]], dtype=object)

In [10]:
df['food']

Jane          Steak
Niko           Lamb
Aaron         Mango
Penelope      Apple
Dean         Cheese
Christina     Melon
Cornelia      Beans
Name: food, dtype: object

In [11]:
df[['color', 'food', 'score']]

           color    food  score
Jane        blue   Steak    4.6
Niko       green    Lamb    8.3
Aaron        red   Mango    9.0
Penelope   white   Apple    3.3
Dean        gray  Cheese    1.8
Christina  black   Melon    9.5
Cornelia     red   Beans    2.2

In [12]:
df[['food']]

             food
Jane        Steak
Niko         Lamb
Aaron       Mango
Penelope    Apple
Dean       Cheese
Christina   Melon
Cornelia    Beans

In [13]:
df[['height', 'color']]

           height  color
Jane          165   blue
Niko           70  green
Aaron         120    red
Penelope       80  white
Dean          180   gray
Christina     172  black
Cornelia      150    red

In [16]:
df['hight']

KeyError: 'hight'

In [17]:
df.loc['Niko']

state        TX
color     green
food       Lamb
age           2
height       70
score       8.3
Name: Niko, dtype: object

In [18]:
df.loc[['Niko', 'Penelope']]

         state  color   food  age  height  score
Niko        TX  green   Lamb    2      70    8.3
Penelope    AL  white  Apple    4      80    3.3

In [19]:
df.loc['Niko':'Dean']

         state  color    food  age  height  score
Niko        TX  green    Lamb    2      70    8.3
Aaron       FL    red   Mango   12     120    9.0
Penelope    AL  white   Apple    4      80    3.3
Dean        AK   gray  Cheese   32     180    1.8

In [20]:
df.loc[:'Aaron']

      state  color   food  age  height  score
Jane     NY   blue  Steak   30     165    4.6
Niko     TX  green   Lamb    2      70    8.3
Aaron    FL    red  Mango   12     120    9.0

In [21]:
df.loc['Dean':]

          state  color    food  age  height  score
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

In [22]:
df.loc[['Dean', 'Cornelia'], ['age', 'state', 'score']]

          age state  score
Dean       32    AK    1.8
Cornelia   69    TX    2.2

In [23]:
df.loc['Jane', 'age']

30

In [24]:
rows = ['Jane', 'Niko', 'Dean', 'Penelope', 'Christina']
cols = ['state', 'age', 'height', 'score']
df.loc[rows, cols]

          state  age  height  score
Jane         NY   30     165    4.6
Niko         TX    2      70    8.3
Dean         AK   32     180    1.8
Penelope     AL    4      80    3.3
Christina    TX   33     172    9.5

In [25]:
df.iloc[3]

state        AL
color     white
food      Apple
age           4
height       80
score       3.3
Name: Penelope, dtype: object

In [26]:
df.iloc[[5, 2, 4]]

          state  color    food  age  height  score
Christina    TX  black   Melon   33     172    9.5
Aaron        FL    red   Mango   12     120    9.0
Dean         AK   gray  Cheese   32     180    1.8

In [27]:
df.iloc[[2,3], [0, 4]]

         state  height
Aaron       FL     120
Penelope    AL      80

In [28]:
df.iloc[0, 2]

'Steak'

In [29]:
some_list = ['a', 'two', 10, 4, 0, 'asdf', 'mgmt', 434, 99]
some_list[5]

some_list[-1]

some_list[:4]

some_list[3:]

some_list[2:6:3]

[10, 'asdf']

In [40]:
df.reset_index().rename(columns={df.index.name:'name'})
print(df)

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

In [43]:
df.set_index("state")

       color    food  age  height  score
state
NY      blue   Steak   30     165    4.6
TX     green    Lamb    2      70    8.3
FL       red   Mango   12     120    9.0
AL     white   Apple    4      80    3.3
AK      gray  Cheese   32     180    1.8
TX     black   Melon   33     172    9.5
TX       red   Beans   69     150    2.2

In [61]:
df = pd.DataFrame({"state":["NY","TX","FL","AL","AK","TX","TX"],
                  "color":["blue","green","red","white","gray","black","red"],
                  "food": ["Steak","Lamb","Mango","Apple","Cheese","Melon","Beans"],
                  "age":  [30,2,12,4,32,33,69],
                  "height":[165,70,120,80,180,172,150],
                  "score": [4.6,8.3,9.0,3.3,1.8,9.5,2.2]
                 },
                  index =["Jane","Niko","Aaron","Penelope","Dean","Christina","Cornelia"]
                )
df

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

In [63]:
df.reset_index(inplace=True)
df

AttributeError: 'NoneType' object has no attribute 'index'